system/probesDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7                                   
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type probes;
libs ("libsampling.so");

// Fields to be probed. runTime modifiable!
        fields
        (
            p
        );

// Locations to be probed. runTime modifiable!
        probeLocations
        (
            ( 0.05 0.05 0 )
        );

// ************************************************************************* //
